import React from 'react';
import styles from './TermsAndConditions.module.css';

const TermsAndConditions = () => {
    return (
        <div className={styles.container}>
            <h1>Общи условия</h1>
            <div className={styles.height}>
                <p>
                    І. ДЕФИНИЦИИ

                    При тълкуването и прилагането на настоящите Общи условия използваните термини и изрази ще имат следното значение:

                    1.1. „IP Адрес” („IP address”) е уникален идентификационен номер, асоцииращ устройство, Интернет страница или ресурс на потребителя, по начин, който позволява локализирането им в глобалната Интернет мрежа.

                    1.2. „Арженто 18” ООД (наричани по-долу Dolche Amaro), е търговско дружество с ЕИК: 205402791, със седалище и адрес на управление: гр. Варна кк.Свети Константин и Елена ул.1,ап.24 e-mail: office_garden@dolceamaro.bg, което предоставя услугите, предмет на настоящите Общи условия, посредством администрираният от него сайт: https://dolceamaro.bg.

                    1.3. www.dolceamaro.bg е уебсайт, посредством който на ПОТРЕБИТЕЛИТЕ се предоставя възможност за закупуване и доставка на храна до посочен от тях адрес.

                    1.4. „Злоумишлени действия” са действия или бездействия, нарушаващи Интернет етиката или нанасящи вреди на лица, свързани към Интернет или асоциирани мрежи, включително, но не само изпращане на нежелана поща (SPAM, JUNK MAIL), препълване на каналите (FLOOD), получаване на достъп до ресурси с чужди права и пароли, използуване на недостатъци в системите с цел собствена облага или добиване на информация (HACK), извършване на действия, които могат да бъдат квалифицирани като промишлен шпионаж или саботаж, повреждане или разрушаване на системи или информационни масиви (CRACK), изпращане на „троянски коне” или предизвикване инсталация на вируси или системи за отдалечен контрол, смущаване нормалната работа на останалите потребители на Интернет и асоциираните мрежи, както и извършване на каквито и да било действия, които могат да се квалифицират като престъпление или административно нарушение по българското законодателство или по друго приложимо право.

                    1.5. „Интернет страница” е част от уебсайт, която може да е съставна или обособена.

                    1.6. „Информационна система” е устройство или система от свързани устройства, което или някое от които е предназначено да съхранява, изпраща или получава електронни документи.

                    1.7. „ПОТРЕБИТЕЛ” е всяко лице, което ползва които и да е от предоставяните през уебсайта www.dolceamaro.bg услуги и ресурси.

                    1.8. „Потребителски профил” е обособена част в www.dolceamaro.bg, съдържаща информация за потребителя, предоставена от него при регистрацията му и съхранявана от www.dolceamaro.bg, като достъпът до потребителския профил се осъществява чрез въвеждане на потребителско име и парола. Профилът дава възможност на потребителя да разглежда и редактира данните, въведени при регистрацията, да има достъп до личната си пощенска кутия, да променя паролата си за достъп, да се абонира, съответно да се откаже от абонамента, за получаване на информационен бюлетин и др.

                    1.9. „Потребителско име” е избран от потребителя уникален код от букви и/или цифри, посредством които той се индивидуализира в www.dolceamaro.bg.

                    1.10. „Парола” е избран от потребителя код комбинация от букви и/или цифри, който заедно с потребителското име индивидуализира същия.

                    1.11. „Потребителско съдържание” е всякакви данни, информация, текст, мнения и коментари, които ПОТРЕБИТЕЛЯТ въвежда на www.dolceamaro.bg с оглед те да бъдат достъпни чрез Уебсайта www.dolceamaro.bg за всички останали ПОТРЕБИТЕЛИ.

                    1.12. „Уебсайт” е обособеното място в глобалната Интернет мрежа, достъпно чрез своя унифициран адрес (URL) по протокол HTTP или HTTPS и съдържащо файлове, програми, текст, звук, картина, изображение, електронни препратки или други материали и ресурси.

                    1.13. „Случайно събитие” е непредвидено към момента на сключване на договора обстоятелство от извънреден характер, което прави изпълнението му обективно невъзможно.

                    1.14. „Търговски съобщения” са рекламни и/или други съобщения, представящи пряко или косвено стоките, услугите или репутацията на лице, извършващо търговска или занаятчийска дейност или упражняващо регулирана професия.

                    ІІ. ПРЕДМЕТ НА ДОГОВОРА

                    2.1. Dolche Amaro, чрез Уебсайта www.dolceamaro.bg предоставя в режим on-line на ПОТРЕБИТЕЛЯ предвидените в тези Общи условия услуги („Услугите”), при стриктно спазване от страна на последния на определените в тези Общи условия изисквания.

                    2.2. Част от Услугите на Уебсайта www.dolceamaro.bg се предоставят на всички ПОТРЕБИТЕЛИ без да е необходима предварителна регистрация. Такива са, без да се ограничават до: достъп до и използване, при спазване правилата на настоящите Общи условия, на разнообразни информационни ресурси, достъпни посредством Уебсайта www.dolceamaro.bg – новини, забавни публикации, промоции или друго предоставено от www.dolceamaro.bg съдържание, както и Потребителско съдържание, публикувано на Уебсайта www.dolceamaro.bg;

                    2.3. Използването на част от Услугите на Уебсайта www.dolceamaro.bg възможно само след предварителна регистрация, създаване на Потребителски профил на ПОТРЕБИТЕЛЯ и въвеждане на потребителското име и паролата.

                    2.4. Отношенията между ПОТРЕБИТЕЛИТЕ и www.dolceamaro.bg във връзка с предлагането, осъществяването на достъп и използването на платени услуги посредством Уебсайта www.dolceamaro.bg се уреждат съгласно правилата, описани в настоящите Общи условия за ползване на съответните платени услуги, достъпни през Уебсайта www.dolceamaro.bg.

                    ІІІ. ПРИЛОЖНО ПОЛЕ. СЪГЛАСИЕ С ОБЩИТЕ УСЛОВИЯ

                    3.1. Настоящите Общи условия се прилагат в отношенията с ПОТРЕБИТЕЛИТЕ, извършили регистрация на Уебсайта www.dolceamaro.bg („регистрираните ПОТРЕБИТЕЛИ”). Настоящите Общи условия се прилагат съответно и в отношенията с ПОТРЕБИТЕЛИТЕ, които не са извършили регистрация на уебсайта www.dolceamaro.bg („нерегистрираните ПОТРЕБИТЕЛИ”), като техните права са ограничени до ползване на услугите, описани в т. 2.2.

                    3.2. Текстът на настоящите Общи условия е достъпен в Интернет на интернет страница с адрес https://www.dolceamaro.bg по начин, който позволява неговото съхраняване и възпроизвеждане. Електронна препратка към Интернет страницата, съдържаща текста на настоящите Общи условия, е разположена на всяка страница от Уебсайта www.dolceamaro.bg. С всяко ползване на услугите и ресурси на Уебсайта www.dolceamaro.bg, включително с отварянето на Интернет страница от Уебсайта www.dolceamaro.bg, както и чрез натискане на електронна препратка от заглавната (началната) или която и да е друга Интернет страница на Уебсайта www.dolceamaro.bg, ПОТРЕБИТЕЛИТЕ декларират, че са запознати с настоящите Общи условия, съгласяват се с тях и се задължават да ги спазват.

                    3.3. За да може да използва услугите по т.2.3. на настоящите Общи условия, ПОТРЕБИТЕЛЯТ трябва предварително да се регистрира, като попълни съответната електронна форма за регистрация, достъпна в реално време (on-line) в Интернет на страницата https://www.dolceamaro.bg.

                    3.3.1 В процеса на регистрация, чрез отбелязване в полето “Съгласен съм с Общите условия на www.dolceamaro.bg и натискане на виртуалния бутон “Регистрация”, ПОТРЕБИТЕЛЯТ, съответно родителят или настойникът на ПОТРЕБИТЕЛЯ, извършва изрично електронно изявление по смисъла на Закона за електронния документ и електронния подпис, с което декларира, че е запознат с настоящите Общи условия, приема ги, съгласява се с тях и се задължава да ги спазва.

                    3.3.2 С регистрирането си ПОТРЕБИТЕЛЯТ получава достъп до всички предлагани от www.dolceamaro.bg услуги. При попълване на формата за регистрация ПОТРЕБИТЕЛЯТ, е длъжен да предостави пълни и верни данни относно самоличността си, съответно личността на ПОТРЕБИТЕЛЯ, и другите изискуеми от електронната форма на www.dolceamaro.bg данни, както и да ги актуализира незабавно при всяка тяхна промяна. ПОТРЕБИТЕЛЯТ гарантира, че данните, които предоставя в процеса на регистрация, са верни, пълни и точни и при промяна на последните ще ги актуализира своевременно.

                    3.3.3 При непредоставяне на изискваните в регистрационната форма лични данни, www.dolceamaro.bg има право да откаже регистрацията.

                    3.3.4 В случай на предоставяне на неверни данни или неотразяване на настъпилите промени, www.dolceamaro.bg има право да прекрати или спре незабавно и без предизвестие предоставянето на Услугите, както и поддържането на регистрацията му. В този случай прекратяването на предоставянето на Услугите се счита за автоматично прекратяване на договора.

                    ІV. ПОТРЕБИТЕЛСКО ИМЕ И ПАРОЛА. ПОТРЕБИТЕЛСКИ ПРОФИЛ

                    4.1. При регистрацията си ПОТРЕБИТЕЛЯТ посочва потребителско име и парола. Ако потребителското име не е вече заето, ПОТРЕБИТЕЛЯТ получава потребителското име и паролата, които е заявил. Чрез тях ПОТРЕБИТЕЛЯТ получава достъп до Потребителския си профил, както и възможност да ползва Услугите по т. 2.3.

                    4.2. Потребителското име представлява уникален код от букви, цифри и знаци, посредством които ПОТРЕБИТЕЛЯТ се индивидуализира при ползването на Услугите по т. 2.3. www.dolceamaro.bg не проверява и не носи отговорност за съвпадението на потребителското име с името на ПОТРЕБИТЕЛЯ, за това дали то засяга права на трети лица и в частност право на име или други лични права, право на търговско наименование (фирма), право на запазена марка или други права на интелектуална собственост.

                    4.3. Паролата представлява код от букви, цифри и знаци, който заедно с потребителското име служи за достъп до определен потребителски профил.

                    4.5. ПОТРЕБИТЕЛЯТ е длъжен да не прави достояние на трети лица паролата си или тайните въпрос и отговор, както и да уведомява незабавно www.dolceamaro.bg в случай на неправомерен достъп или при вероятност от такъв. ПОТРЕБИТЕЛЯТ е длъжен да полага всички грижи и да предприема необходимите мерки, които разумно се налагат, с цел опазване на паролата си, на тайните въпрос и отговор и носи пълна отговорност за всички действия, които се извършват от него или от трето лице чрез използването им.

                    4.6. Потребителският профил представлява обособена част от Уебсайта www.dolceamaro.bg, съдържаща информация за регистрирания ПОТРЕБИТЕЛ, предоставяна в процеса на регистрация и съхранявана на сървър на www.dolceamaro.bg. Чрез потребителския си профил ПОТРЕБИТЕЛЯТ може да използва, настройва, активира или дезактивира използването на различни услуги по т. 2.3. на www.dolceamaro.bg, да управлява разположено от него на сървър на www.dolceamaro.bg Потребителско съдържание, да актуализира данните, предоставени при регистрацията си, да променя паролата си и тайните въпрос и отговор, да прекрати регистрацията си в www.dolceamaro.bg и др.

                    4.7. За да получи достъп до платените услуги на Уебсайта www.dolceamaro.bg, ПОТРЕБИТЕЛЯТ следва да извърши регистрация на обозначена за това Интернет страница или други действия, съгласно изискванията на посочените на страницата Общи условия за ползване на съответната платена услуга.

                    4.8. Всеки ПОТРЕБИТЕЛ може да има само един активен потребителски профил. Забранява се регистрацията под измислено име или под чуждо име (под чужда самоличност). www.dolceamaro.bg може да откаже регистрацията на лице, за което получи информация, че посочва неверни или чужди данни.

                    V. СКЛЮЧВАНЕ НА ДОГОВОРА. НАЧИНИ НА ПЛАЩАНЕ

                    5.1. Договорът между страните поражда действие от момента на постигане на съгласие, обективирано по начина, посочен в т. 3.2 или т. 3.3.1.

                    5.2. Договорът се сключва на български език.

                    5.3. Договорът има действие:

                    а) за нерегистрираните ПОТРЕБИТЕЛИ – до преустановяване на ползването на Услугите по т. 2.2.;

                    б) за регистрираните ПОТРЕБИТЕЛИ – за неопределен срок от регистриране на ПОТРЕБИТЕЛЯ до прекратяването на договора по реда, предвиден в настоящите Общи условия.

                    5.4. Начини за плащане:

                    5.4.1. Когато сте направили своя избор, остава да огледате Вашата кошница и да си уверите в избраното съдържание, след това да преминете към страница Плащане, където да въведете клиентските си данни, коментар към поръчката или промо код, и да поръчате храна за доставка онлайн. В този случай плащанията могат да се извършват на място при получаване на доставката или чрез виртуален ПОС терминал без физическо присъствие на картата. Плащания се приемат с банкови карти, носещи търговските марки на БОРИКА, VISA и MasterCard, Maestro. В случай, че откажете вашата поръчка в рамките на 3 минути или при уважена рекламация, при направено плащане с банкова карта, възстановяването на суми става чрез нареждане на обратна операция по картата, с която е направено плащане в срок от 48 часа.

                    5.4.2. Друг вариант за поръчване е чрез директна връзка, а именно: да се обадите на телефона за доставки на заведение Dolche Amaro, където нашите оператори да приемат и обработят Вашата поръчка. В този случай плащанията могат да се извършват на място при получаване на доставката или чрез виртуален ПОС терминал без физическо присъствие на картата. Плащания се приемат с банкови карти, носещи търговските марки на БОРИКА, VISA и MasterCard, Maestro.

                    5.4.3. Фирма „Арженто 18” ООД не съхранява банкови детайли на своите клиенти, което включва номера на карти, пин кодове и секретни цифри. Всяко едно плащане се извършва чрез автоматично прехвърляне на платформата на УНИКРЕДИТ БУЛБАНК.

                    VI. ПРОМЕНИ В ОБЩИТЕ УСЛОВИЯ

                    6.1. С оглед периодичното допълване и модификации на Услугите, тяхното усъвършенстване и разширяване, както и във връзка с възможни законодателни промени, които рефлектират върху тях, Общите условия могат да бъдат променяни едностранно от Dolche Amaro. Тази промяна може да се извършва и при изменение на вида, естеството или технологията на предоставяните Услуги, при прекратяване предоставянето на определени Услуги, както и при изменение в икономическите условия.

                    6.2. При извършване на промени в Общите условия, Dolche Amaro ги довежда до знанието на ПОТРЕБИТЕЛИТЕ чрез публикуването им на Уебсайта www.dolceamaro.bg. Dolche Amaro предоставя на ПОТРЕБИТЕЛИТЕ двуседмичен срок да се запознаят с промените в Общите условия, след което те влизат в действие.

                    6.3. Тези Общи условия, както и бъдещи изменения в тях, се прилагат и за заварените регистрирани ПОТРЕБИТЕЛИ към датата на влизането им в действие. В срока по т. 6.2. те имат възможността да заявят чрез изпращане на съобщение до Dolche Amaro, че отхвърлят промените. В случай, че изявление за отхвърляне на промените не бъде получено от Dolche Amaro, се счита, че ПОТРЕБИТЕЛЯТ е обвързан от тях. Заявяването от страна на регистриран ПОТРЕБИТЕЛ, че не е съгласен с промените в Общите условия, ще води до автоматично прекратяване на договора между ПОТРЕБИТЕЛЯ и Dolche Amaro за ползване на услугите, предоставяни чрез Уебсайта www.dolceamaro.bg, при което Dolche Amaro има право да спре незабавно достъпа на съответния ПОТРЕБИТЕЛ до потребителския му профил, да прекрати регистрацията му и да изтрие от сървърите си цялото разположено от него Потребителско съдържание.

                    VII. ПРАВА И ЗАДЪЛЖЕНИЯ НА ПОТРЕБИТЕЛЯ

                    7.1. ПОТРЕБИТЕЛЯТ сам осигурява необходимото му за ползването на предоставяните от Dolche Amaro услуги клиентско оборудване (крайни устройства за достъп до Интернет и съответни софтуерни приложения) и достъп до Интернет.

                    7.2. ПОТРЕБИТЕЛЯТ има право на достъп в режим on-line до Услугите, предоставяни чрез Уебсайта www.dolceamaro.bg, при спазване на условията и изискванията за достъп, определени от Dolche Amaro.

                    7.4. ПОТРЕБИТЕЛЯТ се задължава при ползване на предоставяните от Dolche Amaro услуги да не въвежда, разполага на сървър на Dolche Amaro и да не прави достояние по какъвто и да било начин на трети лица Потребителско съдържание – информация, данни, текст, съобщения, както и всякакви други материали или електронни препратки към материали:

                    а. противоречащи на българското законодателство, приложимите чужди закони, настоящите Общи условия, Интернет етиката, правилата на морала и добрите нрави;

                    б. съдържащи насилие (включително насилие над животни), агитация към насилие, унижение на човешкото достойнство, заплаха за живота и телесната неприкосновеност на човека;

                    в. с порнографско или открито сексуално съдържание;

                    д. съдържащи ясно различими тела на жертви от катастрофи и други тежки инциденти;

                    е. Обида към дадена религия, религиозна принадлежност или съдържащи религиозна агитация;

                    ж. представляващи търговска или служебна тайна или друга конфиденциална информация;

                    з. които са обект на право на интелектуална собственост на трети лица, освен със съгласието на титуляра на правото;

                    и. нарушаващи каквито и да било имуществени или неимуществени права или законни интереси на трети лица;

                    й. пропагандиращи дискриминация, основана на пол, раса, образователен ценз, възраст и религия или проповядващи фашистка, расистка или друга недемократична идеология;

                    к. накърняващи доброто име на другиго и призоваващи към насилствена промяна на конституционно установения ред, към извършване на престъпление, към насилие над личността или към разпалване на расова, национална, етническа или религиозна вражда;

                    л. съдържащи информация, подтикваща към или улесняваща извършването на терористична дейност;

                    м. съдържащи информация за чужди пароли и/или права за достъп без съгласието на техния титуляр, както и софтуер за достъп до такива пароли или права;

                    7.5. ПОТРЕБИТЕЛЯТ се задължава при ползване на предоставяните от Dolche Amaro услуги:

                    а. да не извършва злоумишлени действия по смисъла на настоящите Общи условия;

                    б. да уведомява незабавно Dolche Amaro за всеки случай на извършено или открито нарушение при използване на предоставяните услуги;

                    в. да не се представя за друго лице;

                    д. да не използува методи, водещи до принудително зареждане на нежелано от Интернет-потребителите съдържание (“pop-up”, “blind link” и други подобни).

                    7.6. ПОТРЕБИТЕЛЯТ има право по всяко време по своя собствена преценка да прекрати използването на предоставяните от Dolche Amaro Услуги, като дезактивира предоставянето им от Потребителския си профил или друга посочена за целта интернет страница или прекрати регистрацията си на Уебсайта www.dolceamaro.bg, съответно преустанови използването на Услугите по т. 2.2. От момента на прекратяване на регистрацията, а за нерегистрираните ПОТРЕБИТЕЛИ – от момента на преустановяване ползването на услугите по т. 2.2., договорът между страните се счита за автоматично прекратен, а Dolche Amaro спира достъпа на съответния ПОТРЕБИТЕЛ до Потребителския му профил и има право да спре достъпа до и да изтрие от сървърите си цялото разположено от него Потребителско съдържание в съответствие с т.14.2. от настоящите Общи условия. Дезактивирането на предоставяне на определени Услуги не води до прекратяване на договора.

                    7.7. ПОТРЕБИТЕЛЯТ може да осъществява достъп до и да използва каквото и да било съдържание, публикувано на Уебсайта www.dolceamaro.bg, включително до Потребителско съдържание, единствено за лично ползване с нетърговски цели при спазване изискванията на настоящите Общи условия.

                    7.8. ПОТРЕБИТЕЛЯТ се задължава да не осъществява и да не се опитва да придобива неоторизиран достъп до предоставяните от www.dolceamaro.bg услуги чрез прихващане и използване на чужди пароли или каквито и да било други методи, да не заобикаля, поврежда или по друг начин да не смущава нормалната работа на технически или софтуерни приложения на Уебсайта www.dolceamaro.bg, които предотвратяват или ограничават достъпа до чужди електронни пощенски кутии, административни панели, компютърни системи и мрежи, свързани с предоставяните услуги.

                    VIII. ПРАВА И ЗАДЪЛЖЕНИЯ НА DOLCHE AMARO

                    8.1. Dolche Amaro се задължава да полага дължимата грижа за предоставяне на възможност на ПОТРЕБИТЕЛЯ за нормално ползване на Услугите.

                    Ние, Dolche Amaro, поемаме ангажинта да бъдем пред Вашата врата с поръчката Ви в рамките на срока, който Ви е обявен от оператора за поръчки на телефонен номер 0893555444. Гарантираното време за доставка е 90 минути, считано от получаване на поръчката в системата на уеб сайта, при нормален трафик и благоприятни климатични условия. Поръчки над 200 лева изискват повече време за приготвяне и поради тази причина се налага удължаване времето на доставка. Всеки клиент ще бъде своевременно информиран за времето на доставка, докато прави своята поръчка или впоследствие.

                    8.1.2. Dolche Amaro не носи отговорност за неизпълнение или забавено изпълнение на поръчки за доставка, когато това се дължи на форсмажорни обстоятелства или когато това се дължи на действие или събитие, което е извън контрола на Dolche Amaro и не е могло да се предвиди или предотврати.

                    8.1.3. Dolche Amaro гарантира вкусовите характеристики и хранителни качества на доставените продукти по Вашата поръчка в рамките на 2 (два) часа, считано от момента на поръчката. С оглед на това Dolche Amaro препоръчва да консумирате доставените Ви продукти в рамките на посочения по-горе срок. След този срок Dolche Amaro не носи отговорност за вкусовите характеристики и хранителни качества на доставените продукти.

                    8.1.4. При констатиране на несъответствие между Вашата поръчка и доставените продукти в количествено и качествено отношение, Вие имате право да предявите рекламация, съгласно Закона за защита на потребителите. За Вашата рекламация е необходимо да ни уведомите в рамките на 60 мин., считано от часа на предаване на поръчката Ви, като уведомлението се счита за подадено чрез обаждане на телефонния номер за поръчки. Ако Вашето уведомление за рекламация е направено след този срок, Dolche Amaro не се задължава да следва политиката за приемане на рекламации.

                    8.2. Dolche Amaro няма задължението и обективната възможност да контролира начина, по който ПОТРЕБИТЕЛЯТ използва предоставяните Услуги, като не носи отговорност за целите и дейността на ПОТРЕБИТЕЛЯ във връзка с използване на Услугите, както и за вида и характера на Потребителското съдържание. Dolche Amaro няма задължението да извършва наблюдение на информацията, съхранявана на сървърите му или направена достъпна при предоставяне на Услугите, нито да търси факти и обстоятелства, указващи извършването на неправомерна дейност от страна на ПОТРЕБИТЕЛЯ посредством ползването на Услугите.

                    8.3. В съответствие с изискванията на действащото българско законодателство Dolche Amaro съхранява информационни материали и ресурси, разположени от ПОТРЕБИТЕЛЯ на сървър на www.dolceamaro.bg, и има право да ги предоставя на компетентните държавни органи в случаите, когато това е необходимо за запазване правата, законните интереси и сигурността на Dolche Amaro или на трети лица, както и в случаите, когато същите са изискани от съответните държавни органи по надлежен ред.

                    8.4. В случай на неизползване на Потребителския профил на ПОТРЕБИТЕЛ в продължение на 60 дни след регистрацията или изтекат 120 дни от последното му използване, Dolche Amaro има право да спре без предизвестие достъпа на съответния ПОТРЕБИТЕЛ до Потребителския му профил, да прекрати регистрацията му и да изтрие от сървърите си цялото разположено от него Потребителско съдържание. От момента на прекратяване на регистрацията договорът с ПОТРЕБИТЕЛЯ се счита за автоматично прекратен.

                    8.5. Dolche Amaro има право да изпраща търговски съобщения до ПОТРЕБИТЕЛИТЕ с цел да предложи информация и реклами относно свои собствени или офертирани от други търговски дружества стоки и/или услуги, да прави запитвания по най-различни въпроси, да провежда анкети и др. С приемането на настоящите Общи условия ПОТРЕБИТЕЛЯТ се съгласява да получава търговски съобщения от Dolche Amaro.

                    8.6. Dolche Amaro има право, но не и задължение, по своя преценка и без отправяне на предупреждение да спира достъпа до и/или да премахва Потребителско съдържание, когато същото противоречи на предвидените в настоящите Общи условия изисквания.

                    8.7. Dolche Amaro няма задължението да спира достъпа до и/или да премахва Потребителско съдържание, публикувано в Уебсайта www.dolceamaro.bg по искане на ПОТРЕБИТЕЛЯ, който го е публикувал.

                    8.8. Dolche Amaro има право по своя прeценка и/или съобразно получена от трети лица информация,  без отправяне на предупреждение да спира или да ограничава временно достъпа на ПОТРЕБИТЕЛЯ до Услугите по т.2.3., както и достъпа на други ПОТРЕБИТЕЛИ до разположено от него Потребителско съдържание, в случаите когато ПОТРЕБИТЕЛЯТ ползва Услугите в нарушение на българското законодателство, настоящите Общи условия, добрите нрави или други приложими норми.

                    8.91. Dolche Amaro си запазва правото временно или трайно да преустановява предоставянето на конкретни Услуги, достъпни чрез Уебсайта www.dolceamaro.bg, като уведоми за това ПОТРЕБИТЕЛЯ със съобщение на съответните интернет страници или в Потребителския му профил.

                    IХ. ИНТЕЛЕКТУАЛНА СОБСТВЕНОСТ

                    9.1. С разполагането на Потребителско съдържание под каквато и да е форма на Уебсайта www.dolceamaro.bg, ПОТРЕБИТЕЛЯТ предоставя на Dolche Amaro неизключителното право да го използва, записва, съхранява, разпространява публично в Интернет, включително да предлага достъп на неограничен брой лица до него по начин, позволяващ този достъп да бъде осъществен от място и по време, индивидуално избрани от всеки от тях, без да дължи възнаграждение за това и без териториални ограничения (за целия свят). Правото по тази алинея се предоставя за времето, за което Потребителското съдържание е разположено на сървър на Dolche Amaro, както и за разумен срок след премахването или изтриването му.

                    9.2. При използването на Услугите, предмет на настоящите Общи условия, ПОТРЕБИТЕЛЯТ има достъп до разнообразно съдържание и ресурси, които са обект на авторско право или други права на интелектуална собственост на Dolche Amaro, на други ПОТРЕБИТЕЛИ или на съответно указаните лица. ПОТРЕБИТЕЛЯТ има достъп до съдържанието с оглед ползването му за лични нужди в съответствие с настоящите Общи условия и няма право да използва, записва, съхранява, възпроизвежда, променя, адаптира или разпространява публично обекти на интелектуална собственост, които са му станали достъпни при ползването на Услугите.

                    ПОТРЕБИТЕЛЯТ няма право да премахва знаците за търговска марка и принадлежност на друго право на интелектуална собственост от достъпните му материали, независимо дали носителят на съответните права е Dolche Amaro или друг ПОТРЕБИТЕЛ.

                    9.3. Правата на интелектуална собственост върху всички обекти на интелектуална собственост – материали, бази данни и други ресурси, разположени на Уебсайта, извън Потребителското съдържание, разположено от ПОТРЕБИТЕЛИТЕ на Уебсайта www.dolceamaro.bg, са обект на закрила съгласно Закона за авторското право и сродните му права и/или Закона за марките и географските означения, принадлежат на Dolche Amaro или на съответно указаното лице, преотстъпило правото на ползване на Dolche Amaro и не могат да бъдат използвани в нарушение на действащото законодателство.

                    9.4. В случай, че ПОТРЕБИТЕЛЯТ счита, че негови права на интелектуална собственост са нарушени от друг потребител, той следва да уведоми Dolche Amaro в писмена форма на посочения в настоящите Общи условия адрес на управление или чрез писмо, изпратено на адреса на електронна поща, посочен за контакт с Dolche Amaro. Уведомлението следва да съдържа точно идентифициране на материала, за който се твърди, че е публикуван в нарушение на права на интелектуална собственост, посочване на лицето или лицата, чиито права на интелектуална собственост са нарушени и основанието, на което тези лица са станали носители на съответните права, както и адрес и телефон за контакт с ПОТРЕБИТЕЛЯ. Dolche Amaro по своя преценка предприема действията, посочени в т. 11.1. на настоящите Общи условия.

                    Х. ОТГОВОРНОСТ. ОГРАНИЧАВАНЕ НА ОТГОВОРНОСТТА

                    10.1. Dolche Amaro полага грижи за предоставяне на възможност на ПОТРЕБИТЕЛЯ за нормално ползване на Услугите, но доколкото предоставянето им е безплатно няма задължението и не гарантира, че те ще удовлетворят изискванията на ПОТРЕБИТЕЛЯ, нито че ще бъдат непрекъснати, навременни или сигурни. С приемане на настоящите Общи условия, ПОТРЕБИТЕЛЯТ декларира, че използването на предоставяните Услуги ще бъде изцяло на негов риск и отговорност, а страните се съгласяват, че Dolche Amaro не отговоря за евентуално причинени на ПОТРЕБИТЕЛЯ при ползване на предоставяните Услуги вреди.

                    10.2. Dolche Amaro не носи отговорност за наличността и качеството на стоки и съдържанието на услуги, поставени на вниманието на ПОТРЕБИТЕЛЯ чрез публикуване на Уебсайта на електронни препратки, рекламни банери и съобщения за продажба на стоки и предоставяне на услуги от трети лица и/или чрез прикачване на такива към текста на търговските съобщения, изпращани му на адреса на електронна пощенска кутия, посочен от него при регистрацията му или генериран при регистрацията му. Доколкото действията на тези трети лица не са под контрола на Dolche Amaro, то същото не носи отговорност за противоправния характер на дейността на третите лица или за възникването, гарантирането, изпълнението, изменението и прекратяването на поети задължения и ангажименти във връзка с предлаганите от третите лица стоки и услуги, както и не отговаря за претърпени вреди и пропуснати ползи, произтекли от тези отношения.

                    10.3. Dolche Amaro не носи отговорност за непредоставяне на услугите при настъпване на обстоятелства извън неговия контрол – в случаи на непреодолима сила, случайни събития, проблеми в глобалната мрежа Интернет и в предоставянето на услуги извън контрола на Dolche Amaro, проблеми, дължащи се на оборудването на ПОТРЕБИТЕЛЯ, както и при случай на нерегламентиран достъп или интервенция на трети лица във функционирането на информационната система или сървърите на Dolche Amaro.

                    10.4. Dolche Amaro не носи отговорност за вреди, причинени на софтуера, хардуера или съоръженията на ПОТРЕБИТЕЛЯ, или за загуба на данни, произтекли от материали или ресурси, търсени, заредени или използвани по какъвто и да било начин посредством предоставяните Услуги.

                    10.5. Dolche Amaro не носи отговорност спрямо ПОТРЕБИТЕЛЯ и трети лица, за претърпени вреди и пропуснати ползи, настъпили вследствие прекратяване, спиране, променяне или ограничаване предоставянето на която и да било от Услугите, предоставено за ползване на Услугите, изтриването, връщането, неполучаването, модифицирането, загубването, недостоверността, неточността, или непълнотaта на артикули, съобщения, материали или информация, използвани, записвани или станали достъпни чрез Уебсайта www.dolceamaro.bg.

                    10.6. Страните приемат, че Dolche Amaro не носи отговорност за непредоставянето на Услугите или предоставянето им с влошено качество в следствие на извършвани тестове от страна на Dolche Amaro с цел проверка на оборудване, връзки, мрежи и други, както и тестове, насочени към подобряване или оптимизиране на предоставяните Услуги. В тези случаи Dolche Amaro предварително уведомява ПОТРЕБИТЕЛЯ за възможното временно непредоставяне, съответно за влошеното качество на Услугите.

                    10.7. С приемането на настоящите Общи условия ПОТРЕБИТЕЛЯТ декларира, че осъзнава възможността за евентуални прекъсвания и друг вид затруднения при осъществяване на Интернет връзката до Уебсайта www.dolceamaro.bg, които могат да възникнат независимо от положената от страна на Dolche Amaro грижа. ПОТРЕБИТЕЛЯТ декларира, че няма да претендира каквито и да било обезщетения от Dolche Amaro за пропуснати ползи, претърпени вреди или неудобства, вследствие настъпване на посочените по-горе прекъсвания или затруднения на Интернет връзката, включително и по отношение на капацитета на тази връзка.

                    10.8. Dolche Amaro не носи отговорност и не дължи обезщетение на лице, чиито лични данни са използвани от друго лице за ползването на Услугите, предоставяни от Dolche Amaro, независимо дали е дало или не съгласие за това.

                    XI. ПРАВА НА DOLCHE AMARO В СЛУЧАЙ НА НЕИЗПЪЛНЕНИЕ НА ЗАДЪЛЖЕНИЯ НА ПОТРЕБИТЕЛ

                    11.1. Dolche Amaro има правото да спре, ограничи или промени предоставяните на ПОТРЕБИТЕЛЯ Услуги, както и да сезира компетентните държавни органи, ако с поведението си ПОТРЕБИТЕЛЯТ, по преценка на Dolche Amaro, нарушава разпоредби на действащото българско законодателство, на настоящите Общи условия или правата и законните интереси на трети лица, както и по всяко време и без предварително предупреждение да спре достъпа до всяко съдържание, разположено на Уебсайта www.dolceamaro.bg от ПОТРЕБИТЕЛЯ, за което прецени или получи сведения от трети лица, че противоречи на действащото българско законодателство, на настоящите Общи условия или на техни или чужди права и законни интереси, включително права на интелектуална собственост, до разрешаването на подобен спор с акт на компетентен държавен орган.

                    11.2. При получаване на разпореждане от компетентни държавни органи, касаещо Потребителско съдържание, Dolche Amaro има правото без предварително предупреждение да спре достъпа до такова Потребителско съдържание или да извърши други действия, съгласно полученото разпореждане.

                    11.3. Dolche Amaro има правото без предизвестие да дезактивира паролата за достъп до потребителския профил на ПОТРЕБИТЕЛЯ в случай, че по преценка на Dolche Amaro ПОТРЕБИТЕЛЯТ нарушава разпоредби на действащото българско законодателство, на настоящите Общи условия или правата и законните интереси на трети лица. В тези случаи Dolche Amaro има право да прекрати регистрацията на ПОТРЕБИТЕЛЯ, да преустанови предоставянето на ПОТРЕБИТЕЛЯ на Услугите по т. 2.3. и да изтрие от сървърите си цялото разположено от него Потребителско съдържание. Договорът с ПОТРЕБИТЕЛЯ се счита за автоматично прекратен от датата на прекратяване на регистрацията му.

                    11.4. Когато получи информация, която дава достатъчно основания да се предположи, че поведението на ПОТРЕБИТЕЛЯ при ползването на Услугите на Уебсайта www.dolceamaro.bg би могло да представлява престъпление или административно нарушение, Dolche Amaro има правото по своя преценка да сезира компетентните държавни органи, като им предоставя необходимото съдействие и цялата необходима информация и материали, изискани по надлежния ред, които по преценка на съответния орган биха помогнали за идентифициране на извършителя и доказване на извършеното престъпление или административно нарушение.

                    11.5. В горните случаи Dolche Amaro не носи отговорност за претърпени вреди и пропуснати ползи от ПОТРЕБИТЕЛЯ или трети лица, настъпили вследствие спирането, променянето или ограничаването на Услугите, прекратяването на договора или предоставяне на информация или изпълнение на разпореждания на компетентните държавни органи.

                    ХII. ОБЕЗЩЕТЕНИЯ

                    12.1. ПОТРЕБИТЕЛЯТ е длъжен да обезщети Dolche Amaro и всички трети лица за всички претърпени от тях вреди и пропуснати ползи, включително за платени имуществени санкции, адвокатски възнаграждения, съдебни и други разходи, вследствие на предявени искове от и/или платени обезщетения на трети лица във връзка с материали, които ПОТРЕБИТЕЛЯТ е направил достояние на трети лица или е направил достъпни чрез ползване на предоставените от Dolche Amaro Услуги в нарушение на българското законодателство, приложимите чужди закони, настоящите Общи условия или добрите нрави, както и във връзка с други нарушения на задълженията му по настоящите Общи условия.

                    12.2. Вън от посоченото в т.12.1, ПОТРЕБИТЕЛЯТ се задължава да обезщети Dolche Amaro за всички вреди, причинени вследствие ползване на предоставените Услуги от трети лица, на които последният е предоставил паролата си или тайните въпрос и отговор в нарушение на настоящите Общи условия.

                    12.3. Родителите, упражняващи родителски права, настойниците или попечителите на ненавършило пълнолетие лице, отговарят за всички вреди, причинени от същото на Dolche Amaro и на трети лица при регистрацията и ползването на Услугите – предмет на настоящите Общи условия, както и за всички вреди вследствие посочване на неверни данни или неистинност на декларацията по т. 3.3.2, изречение последно.

                    12.4. Задълженията на лицата по настоящият раздел ХІІ продължават действието си и след прекратяване на договора с ПОТРЕБИТЕЛЯ.

                    ХІІI. ЗАЩИТА НА ЛИЧНИТЕ ДАННИ

                    13.1. Dolche Amaro има право да събира и използва информация относно ПОТРЕБИТЕЛИТЕ. Информацията, чрез която лицето може да бъде идентифицирано, може да включва име, презиме, фамилия, дата на раждане, пол, населено място, електонна поща, както и всяка друга информация, която ПОТРЕБИТЕЛЯТ доброволно въвежда, използва или предоставя при ползване на Услугите на Уебсайта www.dolceamaro.bg.

                    13.2. Всеки регистриран ПОТРЕБИТЕЛ чрез своите потребителско име и парола има право на достъп в режим on-line до потребителския си профил, където може да поправя и актуализира своите лични данни, съхранявани от Dolche Amaro.

                    13.3. Фирма „Арженто 18” ООД полага дължимата грижа за събирането, обработването и съхраняването на личните данни на ПОТРЕБИТЕЛИТЕ и гарантира на своите клиенти конфиденциалността на предоставената от тях информация и данни, при стриктно спазване на разпоредбите на Закона за защита на личните данни и действащата нормативна уредба.

                    13.4. Dolche Amaro полага дължимата грижа и отговаря за защита на информацията за ПОТРЕБИТЕЛЯ, станала му известна по повод на предоставяне на Услугите, предмет на тези Общи условия, освен в случаите на непреодолима сила, случайно събитие или злоумишлени действия на трети лица, както и в случаите, при които ПОТРЕБИТЕЛЯТ сам е направил достъпна тази информация за трети лица.

                    13.5. В регистрационната форма, попълвана от ПОТРЕБИТЕЛЯ при сключване на договора, Dolche Amaro ясно обозначава задължителния или доброволния характер на предоставяне на данните и последиците от отказ за предоставяне. С изразяване на съгласие с настоящите Общи условия ПОТРЕБИТЕЛЯТ се съгласява информацията за него да бъде обработвана по предвидения в тях ред.

                    13.6. Dolche Amaro събира и използва информацията по т. 13.1 за целите, предвидени в настоящите Общи условия, включително за предлагане на нови услуги на потребителите, предлагане на офертирани от други лица стоки и/или услуги, за промоции, организиране на томболи, запитвания, за статистически и всякакви други цели, като с регистрирането си за ползване на Услугите, ПОТРЕБИТЕЛЯТ се съгласява да получава търговски съобщения, изпращани от Dolche Amaro. Описаните цели, за които може да се използва информацията, не са изчерпателно изброени и не пораждат задължения за Dolche Amaro.

                    13.7. С приемането на настоящите Общи условия, ПОТРЕБИТЕЛЯТ се съгласява с обработването на личните му данни за целите на директния маркетинг. ПОТРЕБИТЕЛЯТ има право да възрази срещу обработването на личните му данни за целите на директния маркетинг, като изпрати писмено съобщение до Dolche Amaro на посочените адрес или email за контакти. ПОТРЕБИТЕЛЯТ има право да бъде уведомен преди личните му данни да бъдат разкрити за пръв път на трети лица или използвани от тяхно име за целите на директния маркетинг като му бъде предоставена възможност да възрази срещу такова разкриване или използване.

                    13.8. Dolche Amaro се задължава да не редактира или разкрива никаква лична информация за ПОТРЕБИТЕЛЯ или за ползването от него на Услугите и да не предоставя събраната информация на трети лица – държавни органи, търговски дружества, физически лица и други, освен в случаите когато:

                    а/ това е предвидено в настоящите Общи условия или ПОТРЕБИТЕЛЯТ е дал изричното си съгласие при регистрацията или в по-късен момент;

                    б/ това е необходимо за изпълнение на нормативно установено задължение на Dolche Amaro;

                    в/ информацията е изискана от държавни органи или длъжностни лица, които според действащото законодателство са оправомощени да изискват и събират такава информация при спазване на законово установените процедури;

                    г/ информацията относно личните данни се предоставя на служители или подизпълнители на Dolche Amaro за дейности по администриране на същия и ползването на Услугите;

                    д/ други посочени в закона случаи.

                    13.9. При използване на Уебсайта www.dolceamaro.bg, Dolche Amaro има правото автоматично да запазва определена информация, която компютър или друго крайно устройство на ПОТРЕБИТЕЛЯ изпраща към сървър на Dolche Amaro във връзка с активността на ПОТРЕБИТЕЛЯ. Информацията се съхранява в лог-файлове на сървъри на Dolche Amaro и може да включва IP адреса на ПОТРЕБИТЕЛЯ, дата и час, в който е посетена съответната страница от Уебсайта www.dolceamaro.bg, времето прекарано на нея и др. В допълнение, Dolche Amaro съхранява IP адреса на ПОТРЕБИТЕЛЯ, както и всяка друга информация, необходима за идентифициране на ПОТРЕБИТЕЛЯ и възпроизвеждане на електронното му изявление по т. 3.2., съответно т. 3.3.1 за приемане на Общите условия, в случай на възникване на правен спор.

                    13.10. Dolche Amaro има право, но не и задължение, да инсталира върху компютър или друго крайно устройство на ПОТРЕБИТЕЛЯ кукита (cookies) – малки текстови файлове, които се запазват от Интернет страница чрез Интернет сървър върху твърдия диск на ПОТРЕБИТЕЛЯ и дават възможност за възстановяване на информация за ПОТРЕБИТЕЛЯ, като го идентифицират, както и за проследяване на действията му.

                    XIV. ПРЕКРАТЯВАНЕ И РАЗВАЛЯНЕ НА ДОГОВОРА

                    14.1. Освен в случаите, предвидени в настоящите Общи условия, договорът между страните се прекратява и при настъпване на някое от следните обстоятелства:

                    а/ преустановяване на дейността на Dolche Amaro или прекратяване на поддържането на Уебсайта www.dolceamaro.bg;

                    б/ взаимно съгласие на страните за прекратяването;

                    в/ други предвидени в закона случаи.

                    14.2. В случай на прекратяване на договора между страните на каквото и да е основание, Dolche Amaro има право да спре незабавно достъпа на съответния ПОТРЕБИТЕЛ до потребителския му профил, да прекрати регистрацията му и да изтрие от сървърите си цялото разположено от него Потребителско съдържание, при спазване на изискванията на приложимото законодателство. В случай на прекратяване на договора Dolche Amaro не носи отговорност за претърпени вреди и пропуснати ползи от ПОТРЕБИТЕЛЯ или трети лица, настъпили вследствие на спирането на достъпа на ПОТРЕБИТЕЛЯ до потребителския му профил, прекратяването на регистрацията му, изтриването на разположеното от ПОТРЕБИТЕЛЯ Потребителско съдържание от сървърите на Dolche Amaro, както и вследствие предоставянето на информация или изпълнение на разпореждания на компетентните държавни органи.

                    ХV. ДРУГИ УСЛОВИЯ

                    15.1. Предвидените в договора и настоящите Общи условия писмени или електронни изявления и съобщения се считат за валидно извършени, ако са направени под формата на писмо с обратна разписка, факсимилно съобщение, електронна поща, натискане на виртуален бутон в Уебсайта www.dolceamaro.bg и други подобни, доколкото изявлението е записано технически по начин, който дава възможност да бъде възпроизведено.

                    15.2. С приемане на настоящите Общи условия и сключване на договор помежду си, страните изразяват съгласието си да считат отправените електронни изявления помежду им за получени с постъпването им в посочената от адресата информационна система, без за това да е необходимо изрично потвърждаване. Когато Dolche Amaro е адресат на изявлението, то за постъпване на изявлението в посочена от адресата информационна система се счита постъпването му в POP3 сървърите на Dolche Amaro. Когато ПОТРЕБИТЕЛЯТ е адресат на изявлението, то за постъпване на изявлението в посочената при регистрацията му електронна пощенска кутия, разположена на сървър в рамките на съответния адресиращ кутията домейн.

                    В случай, че ПОТРЕБИТЕЛЯТ е посочил невалидна електронна пощенска кутия, то изявлението ще се счита за получено само с изпращането му от Dolche Amaro, дори ако не е било получено.

                    15.3. Страните се съгласяват, че в случай, че някоя от клаузите по настоящите Общи условия се окаже недействителна, това няма да влече недействителност на договора по отношение на останалите му клаузи или негови части. Недействителната клауза ще бъде заместена от повелителните норми на закона или установената практика.

                    15.4. Уебсайтът www.dolceamaro.bg се поддържа от Dolche Amaro посредством техническо оборудване, разположено на територията на Република България. Dolche Amaro не гарантира и не носи отговорност за достъпността и надлежното предоставяне на Услугите на Уебсайта www.dolceamaro.bg извън територията на Република България, както и в частност населените места, в които не се осъществява доставка, могат да се използват само неплатени услуги.

                    15.5. За всички неуредени от настоящия договор въпроси се прилагат разпоредбите на действащото законодателство на Република България.

                    15.6. Всички спорове между страните се решават в дух на разбирателство и добра воля. В случай, че съгласие не бъде постигнато, всички неразрешени спорове, породени от договора между страните или отнасящи се до него, включително спорове, породени или отнасящи се до неговото тълкуване, недействителност, изпълнение или прекратяване, както и спорове за попълване на празноти в договора или приспособяването му към нововъзникнали обстоятелства, ще бъдат разрешавани от компетентния по действащото българско законодателство съд.

                    Според действащата законодателна система продажбата на алкохол и цигари е забранена за лица под 18-годишна възраст. При съмнение от страна на доставчика по време на финализиране и предаване на направената поръчка, клиентът се задължава да удостовери и покаже личната си карта.

                    В случай, че клиентът е лице под 18-годишна възраст, алкохол или цигари няма да бъдат предадени и ще бъдат върнати в обслужващо зоната за доставка заведение.

                    В случай, че клиент желае да откаже направена поръчка, това може да стане в рамките на 15 минути след приемането й, и отказът може да бъде удовлетворен, след позвъняване на 0893555444. При отказ от страна на клиент след 3-тата минута същият се добавя в база данни „Черен списък” – списък от клиенти, чиито поръчки няма да бъдат изпълнявани.

                    Настоящите Общи условия са приети с решение на ЕСК „Арженто 18” ООД от 01.07.2019 г. и влизат в сила от датата на приемането им.
                </p>
            </div>
        </div>
    );
};

export default TermsAndConditions;
